/*
	TODO:
	Створити абстрактний тип даних - клас вектор, в якому визначені покажчик на int, кількість елементів. 
	Визначити конструктор без параметрів, конструктор з параметром, конструктор з двома параметрами. 
	Конструктор без параметрів виділяє місце для одного елемента і ініціалізує його в нуль. 
	Конструктор з одним параметром (розмір вектора) виділяє місце і ініціалізує номером у векторі, 
	конструктор з двома параметрами виділяє місце (перший аргумент) і ініціалізує другим аргументом. 
	Деструктор звільняє пам’ять. Визначити функцію, яка надає елементу вектора деяке значення (параметр за замовчуванням), 
	функцію яка повертає певний елемент вектора. Визначити функцію друку. Визначити функції додавання , множення, віднімання, 
	які здійснюють ці арифметичні операції з даними цього класу і вбудованого int. Визначити методи порівняння: більше, менше 
	або дорівнює. Перевірити роботу цього класу.
*/
#include <iostream>
#include "uvector.h"
using uvector::Vector;

int main()
{
	
	Vector vector1(10, 5);
	Vector vector2(10, 2);
	std::cout << vector1 + vector2 << std::endl;
	std::cout << vector1 - vector2 << std::endl;
	std::cout << vector1 * vector2 << std::endl;

	vector2[5] = 6;
	std::cout << vector2[5] << std::endl << std::endl;

	if (vector2 < vector1) {
		std::cout << "True" << std::endl;
	}

	
	system("pause");
}


